# Файл, содержащий структуру квиза (вопросы, варианты ответов, правильные ответы).

# Структура квиза
quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    # {
    #     'question': 'Какой тип данных используется для хранения целых чисел?',
    #     'options': ['int', 'float', 'str', 'natural'],
    #     'correct_option': 0
    # },
    # {
    #     'question': 'Какая функция выводит что-либо в консоль?',
    #     'options': ['write()', 'log()', 'out()', 'print()'],
    #     'correct_option': 3
    # },
    # {
    #     'question': 'Сколько библиотек можно импортировать в один проект?',
    #     'options': ['Не более 3', 'Не более 10', 'Не более 5', 'Неограниченное кол-во'],
    #     'correct_option': 3
    # },
    # {
    #     'question': 'Где правильно создана переменная?',
    #     'options': ['int num = 2', 'Верного нет', 'var num = 2', 'num = float(2)'],
    #     'correct_option': 3
    # },
    # {
    #     'question': 'Какая библиотека отвечает за время?',
    #     'options': ['localtime', 'time', 'clock', 'Time'],
    #     'correct_option': 1
    # },
    # {
    #     'question': 'Какой метод используется для ввода данных?',
    #     'options': ['get()', 'cin()', 'input()', 'read()'],
    #     'correct_option': 2
    # },
    # {
    #     'question': 'В каком году появился Python?',
    #     'options': ['1990 году', '1991 году', '2000 году', '1989 году'],
    #     'correct_option': 1
    # },
    # {
    #     'question': 'Для чего в Python используется функция enumerate()?',
    #     'options': ['Для определения кол-ва элементов последовательнолсти',
    #                 'Для одновременного итерирования по самим элементам и их индексам',
    #                 'Для сортировки элементов по значениям id'],
    #     'correct_option': 1
    # },
    # {
    #     'question': 'Имеется кортеж вида Т = (4, 2, 3). \
    #          Какая из операций приведёт к тому, что имя Т будет ссылаться на кортеж (1, 2, 3)?',
    #     'options': ['Т[0] = 1',
    #                 'T = (1) + T[1:]',
    #                 'T = (1,) + T[1:]',
    #                 'T.startswith(1)'],
    #     'correct_option': 2
    # }
]